{
  "Projects": [
    {
      "show": true,
      "title": "Audit",
      "slug": "audit",
      "desc": [
        "Learning the auditing process a cybersecurity professional is usually tasked with was a very interesting experience. I actually started this project in 2024 independently and didn't really have any direction. It was one of those cases where I did the assignment and just moved on. I decided to enhance my studies and revisit the project to understand the process better.",
        "I wanted to create an audit that reflected current security standards and my professional brand as well. Using Affinity, I created an audit template with a structured design in mind. Separating each step in addressing the company's audit categories, I was able to display a clear process of my observations.",
        "I experienced an improvement in how I represent other people through my words. Throughout the entire project, I kept in mind, \"How can I make this easier to understand for someone who isn't knowledgeable on this topic? How did I learn this process?\" I understood that multiple people would read this type of document, and everyone would have to identify the same exact problems and solutions."
      ],
      "pdf": "https://drive.google.com/file/d/1k49Qtl3O8pXP7eicWljQvAIPurRcV-56/view?usp=sharing",
      "images": [
        "/image/projects/001 Audit/A1.png",
        "/image/projects/001 Audit/A2.png",
        "/image/projects/001 Audit/A3.png",
        "/image/projects/001 Audit/A4.png"
      ]
    },
    {
      "show": true,
      "title": "Project 002 : Incident Reports",
      "slug": "incident-reports-no-002",
      "desc": [
        "Incident reporting is a crucial task of risk assessment for multiple tech-based roles, and I was excited to get some hands-on experience! For each fictional scenario, I was tasked with thoroughly addressing the event, providing recorded evidence, and suggesting future improvements on how to reduce the chance of risk factors."
      ],
      "reports": [
        {
          "title": "01 Access Error",
          "desc": [
            "I wanted to get more experience reading system logs in real-time and understanding of what the web service does when assessing a connection request. This was my first time setting up Linux on a virtual machine and I learned so much! I utilized ChatGPT to help learn access error simulation strategies, for this scenario, and refuse a connection to the specified domain."
          ],
          "pdf": "https://drive.google.com/file/d/1cYa-1Xl8C8SG0mGoEtK4bfr27nO0-yRB/view?usp=sharing",
          "images": [
            "/image/projects/002 Incident Reports/TB01_Access Error/Images/Incident Report_DNS Access Error_Taylor Bryant_Mockup.png",
            "/image/projects/002 Incident Reports/TB01_Access Error/Images/Incident Report_DNS Access Error_Taylor Bryant_PNG.png"
          ]
        },
        {
          "title": "02 SYN Attack",
          "desc": [
            "This scenario addressed a simple request to a web service being met with a malicious response, an attack during the connection. Before this project, I was not properly aware of the inner workings of each step when attempting a connection to a website. There are steps within steps! Focusing on the SYN response chain, I was able to compare what happened and what was supposed to occur."
          ],
          "pdf": "https://drive.google.com/file/d/1WF_sGDmB6HQBAnFeVOuOmyFMtEH01W4h/view?usp=sharing",
          "images": [
            "/image/projects/002 Incident Reports/TB02_SYN Attack/Images/Incident Report_SYN Attack_Taylor Bryant_Mockup.png",
            "/image/projects/002 Incident Reports/TB02_SYN Attack/Images/Incident Report_SYN Attack_Taylor Bryant_PNG.png"
          ]
        },
        {
          "title": "03 OS Hardening",
          "desc": [
            "Navigating how to properly instruct others on how to protect their systems better opened my eyes to how to relay important information better. I altered my language to be more specific and possibly stand out to the person reading the report. Understanding the importance of having several layers of security was vital in recognizing holes on an attack surface."
          ],
          "pdf": "https://drive.google.com/file/d/1NkKFQrHm0JEIe2smh_jvfTSo6MBm_kty/view?usp=sharing",
          "images": [
            "/image/projects/002 Incident Reports/TB03_OS Hardening/Images/Incident Report_OS Hardening_Taylor Bryant_Mockup.png",
            "/image/projects/002 Incident Reports/TB03_OS Hardening/Images/Incident Report_OS Hardening_Taylor Bryant_PNG.png"
          ]
        },
        {
          "title": "04 Network Hardening",
          "desc": [
            "As a short report, I tried to address each primary concern with a detailed response that would still be easy for the reader to digest. I'm still trying to improve the wording of what I observe during an incident by being more descriptive. Expanding the dialogue I used to describe the actions, thoughts, and recommendations utilized by the team in order to properly assess the incident were part of some of my observations."
          ],
          "pdf": "https://drive.google.com/file/d/1GKes5R5825pVmzosnEPeJyPx7yp9tL68/view?usp=sharing",
          "images": [
            "/image/projects/002 Incident Reports/TB04_Network Hardening/Images/Incident Report_Network Hardening_Taylor Bryant Mockup.png",
            "/image/projects/002 Incident Reports/TB04_Network Hardening/Images/Incident Report_Network Hardening_Taylor Bryant PNG.png"
          ]
        },
        {
          "title": "05 ICMP Flood",
          "desc": [
            "Although it is important to visualize the possible attacks that can happen on an attack surface, learning how to report the response to attacks is vital as well. This scenario featured a DDoS attack, specifically an ICMP flood during an attempted connection to a website, that required proper escalation before and after the incident. At the bottom of the report, several changes were thoughtfully documented to address the main concerns of hardening."
          ],
          "pdf": "https://drive.google.com/file/d/14zhY11CvpNF93pbh9kcTl51gXBZzYW7O/view?usp=sharing",
          "images": [
            "/image/projects/002 Incident Reports/TB05_ICMP Attack/Images/Incident Report_ICMP Attack_Taylor Bryant Mockup.png",
            "/image/projects/002 Incident Reports/TB05_ICMP Attack/Images/Incident Report_ICMP Attack_Taylor Bryant PNG.png"
          ]
        }
      ]
    }
  ]
}
